## Useful Programs & Practice

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Name": ["Amit", "Priya", "Ravi", "Neha"],
    "Age": [23, 21, 25, 22],
    "Marks": [85, 90, 88, 92],
    "Score": [85, 90, 88, 92]
})

In [3]:
# Filter students with marks > 50
print(df[df["Score"] > 50])

    Name  Age  Marks  Score
0   Amit   23     85     85
1  Priya   21     90     90
2   Ravi   25     88     88
3   Neha   22     92     92

In [4]:
df

    Name  Age  Marks  Score
0   Amit   23     85     85
1  Priya   21     90     90
2   Ravi   25     88     88
3   Neha   22     92     92

In [7]:
# Count missing values per column
print(df2.isnull().sum())

A    1
B    1
dtype: int64

In [6]:
data = {"A": [1, np.nan, 3], "B": [4, 5, np.nan]}
df2 = pd.DataFrame(data)

In [8]:
# Top N records
print(df.nlargest(2, "Score"))

    Name  Age  Marks  Score
3   Neha   22     92     92
1  Priya   21     90     90

In [9]:
# Convert categorical to numeric
df['Gender'] = ["M", "F", "M", "F"]
df['Gender_num'] = df['Gender'].map({"M": 1, "F": 0})

In [10]:
df

    Name  Age  Marks  Score Gender  Gender_num
0   Amit   23     85     85      M           1
1  Priya   21     90     90      F           0
2   Ravi   25     88     88      M           1
3   Neha   22     92     92      F           0

In [12]:
# Grouping by multiple columns
df_group = pd.DataFrame({
    "Dept": ["IT", "IT", "HR", "HR"],
    "Gender": ["M", "F", "M", "F"],
    "Salary": [40000, 42000, 50000, 52000]
})

In [13]:
df_group

  Dept Gender  Salary
0   IT      M   40000
1   IT      F   42000
2   HR      M   50000
3   HR      F   52000

In [14]:
print(df_group.groupby(["Dept", "Gender"])["Salary"].mean())

Dept  Gender
HR    F         52000.0
      M         50000.0
IT    F         42000.0
      M         40000.0
Name: Salary, dtype: float64